// ---------- Navbar titles
const faNavbarData = {
    title: "نام شما",
    home: "خانه",
    publications: "مقالات",
    research: "تحقیقات",
    jobs: "سوابق شغلی",
    contact: "ارتباط با من",
};

// ---------- Home page data
const faHomePageData = {
    name: "نام شما",
    jobTitle: "عنوان شغلی",
    home_title: "درباره من",
    home_content: `
    <div>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد</p>
      <h2 class='title'>کارهای من</h2>
      <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد.</p>
      <ul>
        <li>عنوان پیشفرض 1</li>
        <li>عنوان پیشفرض 2</li>
        <li>عنوان پیشفرض 3</li>
      </ul>
    </div>
    `,
};